Table of Contents
 Class Wall
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Representation of Wall in IDEA StatiCa Detail
public class Wall : Element2D, IGeometryPart
Inheritance
object
OpenObject
OpenElementId
Element2D
Wall
Implements
IGeometryPart
Derived
WallRect
Inherited Members
 Element2D.Name
 Element2D.Material
 Element2D.GeometricRegion
 Element2D.Thickness
 Element2D.EccentricityZ
 Element2D.InnerLines
 Element2D.InnerPoints
 Element2D.ElementType
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 Wall()
Constructor
public Wall()
Properties
 Edges
Lines of Element2D including edges, which are created by opening
public List<ReferenceElement> Edges { get; set; }
Property Value
List<ReferenceElement>
 GeomId
Id representing geometrical parts of Detail
public int GeomId { get; set; }
Property Value
int
 InsertPoint
Insert point 0 - 9
public int InsertPoint { get; set; }
Property Value
int
 MasterComponent
Master component
public ReferenceElement MasterComponent { get; set; }
Property Value
ReferenceElement
 MasterPoint
Master point 0 - 9
public int MasterPoint { get; set; }
Property Value
int
 Position
Offset between MasterPoint and InsertPoint If MasterPoint is null, position is from origin of coordinate system
public Vector3D Position { get; set; }
Property Value
Vector3D
 Edit this page